---
kind: type
id: T:Autodesk.Revit.DB.FabricationDimensionType
source: html/d3793b6f-282c-3e9a-67f0-e80f38c47162.htm
---
# Autodesk.Revit.DB.FabricationDimensionType

Fabrication dimension type.

## Syntax (C#)
```csharp
public enum FabricationDimensionType
```